testing/user-loadtest.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 1
      name: "Warming up"
    - duration: 22
      arrivalRate: 1
      rampTo: 2
      name: "Ramping up"
    - duration: 15
      arrivalRate: 3
      name: "Sustained load"
  processor: "./processor.js"
 
scenarios:
  - name: "Sign up flow"
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/forgot"
      - think: 2
      - get:
          url: "/register"
      - think: 3
      - post:
          url: "/register"
          beforeRequest: generateSignupData
          json:
            firstName: "{{ firstName }}"
            lastName: "{{ lastName }}"
            email: "{{ email }}"
            phone: "{{ phone }}"
            password: "{{ password }}"
            dateOfBirth: "{{ dateOfBirth }}"
            gender: "{{ gender }}"
      # - get:
      #     url: "/"
      # - think: 3
      # - post:
      #     url: "/"
      #     beforeRequest: generateLoginData
      #     json: 
      #     email: "{{ email }}"
      #     password: "{{ password }}"